## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 8 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_inventory_cartography_state_machine"  {
      ~ id      = "1500338678" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:1",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:6",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:6",
              - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:1",
              ~ (known after apply),
              ~ (known after apply),
                # (2 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.cartography_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cartography_policies"  {
      ~ id      = "355289114" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::996667111599:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::957818836222:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::955148791056:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::925306372402:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::902343555465:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::894242006032:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::871282759583:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::843973686572:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::820252213580:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::806545929748:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::805525519938:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::794722365809:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::773858180673:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::762579868088:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::729164266357:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::722713121070:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::687401027353:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::637287734259:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::595701125956:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::563894450011:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::537819865265:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::515018049985:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::507252742351:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::473697194269:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::472286471787:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::414662622316:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::406214159830:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::400061975867:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::349837941862:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::339850311124:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::296255494825:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::283582579564:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::276192857112:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::239043911459:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::236007890657:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::160411545784:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::136676205420:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::124044056575:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::059208818674:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::028051698106:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::009883649233:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::005133826942:role/secopsAssetInventorySecurityAuditRole",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/shared_key",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/customer_id",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.template_file.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "asset_inventory_cartography_state_machine"  {
      ~ id       = "5e20ffe31884fd79457b39ec7f41835ec78e91d22b4add7346271ca54195061f" -> (known after apply)
      ~ rendered = jsonencode(
            {
              - Comment        = "Run daily asset inventory of cloud assets"
              - StartAt        = "Get AWS accounts"
              - States         = {
                  - "Get AWS accounts"         = {
                      - Next           = "Map"
                      - Parameters     = {
                          - Name = "/cartography/asset_inventory_account_list"
                        }
                      - Resource       = "arn:aws:states:::aws-sdk:ssm:getParameter"
                      - ResultSelector = {
                          - "accounts.$" = "States.StringToJson($.Parameter.Value)"
                        }
                      - Type           = "Task"
                    }
                  - Map                        = {
                      - ItemsPath      = "$.accounts"
                      - Iterator       = {
                          - StartAt = "Pass"
                          - States  = {
                              - Cartography      = {
                                  - Catch      = [
                                      - {
                                          - ErrorEquals = [
                                              - "States.ALL",
                                            ]
                                          - Next        = "Handle Failure"
                                          - ResultPath  = null
                                        },
                                    ]
                                  - End        = true
                                  - Parameters = {
                                      - Cluster              = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
                                      - LaunchType           = "FARGATE"
                                      - NetworkConfiguration = {
                                          - AwsvpcConfiguration = {
                                              - SecurityGroups = [
                                                  - "sg-03caf974f268a3efb",
                                                ]
                                              - Subnets        = [
                                                  - "subnet-08cab5daf34489c53",
                                                  - "subnet-07f8e17bbf11b0797",
                                                  - "subnet-0d92713028fd15243",
                                                ]
                                            }
                                        }
                                      - Overrides            = {
                                          - ContainerOverrides = [
                                              - {
                                                  - Environment = [
                                                      - {
                                                          - Name      = "AWS_ACCOUNT"
                                                          - "Value.$" = "$.account"
                                                        },
                                                      - {
                                                          - Name  = "AWS_CONFIG_FILE"
                                                          - Value = "/config/role_config"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_URI"
                                                          - Value = "bolt://neo4j.internal.local:7687"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_USER"
                                                          - Value = "neo4j"
                                                        },
                                                    ]
                                                  - Name        = "cartography"
                                                },
                                            ]
                                        }
                                      - TaskDefinition       = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:6"
                                    }
                                  - Resource   = "arn:aws:states:::ecs:runTask.sync"
                                  - Retry      = [
                                      - {
                                          - BackoffRate     = 2
                                          - ErrorEquals     = [
                                              - "ECS.AmazonECSException",
                                            ]
                                          - IntervalSeconds = 300
                                          - MaxAttempts     = 4
                                        },
                                    ]
                                  - Type       = "Task"
                                }
                              - "Handle Failure" = {
                                  - End  = true
                                  - Type = "Pass"
                                }
                              - Pass             = {
                                  - Next       = "Cartography"
                                  - Parameters = {
                                      - "account.$" = "$"
                                    }
                                  - Type       = "Pass"
                                }
                            }
                        }
                      - MaxConcurrency = 1
                      - Next           = "Neo4J Sentinel Forwarder"
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - "Neo4J Sentinel Forwarder" = {
                      - End        = true
                      - Parameters = {
                          - Cluster              = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
                          - LaunchType           = "FARGATE"
                          - NetworkConfiguration = {
                              - AwsvpcConfiguration = {
                                  - SecurityGroups = [
                                      - "sg-03caf974f268a3efb",
                                    ]
                                  - Subnets        = [
                                      - "subnet-08cab5daf34489c53",
                                      - "subnet-07f8e17bbf11b0797",
                                      - "subnet-0d92713028fd15243",
                                    ]
                                }
                            }
                          - TaskDefinition       = "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:1"
                        }
                      - Resource   = "arn:aws:states:::ecs:runTask.sync"
                      - Type       = "Task"
                    }
                }
              - TimeoutSeconds = 86400
            }
        ) -> (known after apply)
      ~ vars     = {
          ~ "CARTOGRAPHY_TASK_DEF"              = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:6" -> (known after apply)
          ~ "SENTINEL_NEO4J_FORWARDER_TASK_DEF" = "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:1" -> (known after apply)
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.cartography_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cartography_container_definition"  {
      ~ id       = "0c6988e8d3a76eccd6be98c8c2405621410e9ce14f9910553e73910ba34c4af0" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "AWS_CONFIG_FILE"
                          - value = "/config/role_config"
                        },
                      - {
                          - name  = "NEO4J_URI"
                          - value = "bolt://neo4j.internal.local:7687"
                        },
                      - {
                          - name  = "NEO4J_USER"
                          - value = "neo4j"
                        },
                    ]
                  - essential        = true
                  - image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cartography:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/cartography"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "cartography-task"
                        }
                    }
                  - name             = "cartography"
                  - portMappings     = [
                      - {
                          - ContainerPort = 443
                          - Protocol      = "tcp"
                          - hostPort      = 443
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEO4J_SECRETS_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.template_file.neo4j_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "neo4j_container_definition"  {
      ~ id       = "ba67aa5981a179adde69e0b0f03a1adcfdc21748916cdce84f71fb20be491578" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "NEO4J_dbms_memory_pagecache_size"
                          - value = "4G"
                        },
                      - {
                          - name  = "NEO4J_dbms.memory.heap.initial_size"
                          - value = "4G"
                        },
                      - {
                          - name  = "NEO4J_dbms_memory_heap_max__size"
                          - value = "4G"
                        },
                      - {
                          - name  = "NEO4J_ACCEPT_LICENSE_AGREEMENT"
                          - value = "yes"
                        },
                    ]
                  - essential        = true
                  - image            = "neo4j:3.5.32@sha256:a5e2dc0ee57c7943342c981b5037c1bf961980f00fe8d6f6304d2b24102d6f5b"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/neo4j"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "neo4j-task"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/var/lib/neo4j/data"
                          - readOnly      = false
                          - sourceVolume  = "neo4j-efs-volume"
                        },
                    ]
                  - name             = "neo4j"
                  - portMappings     = [
                      - {
                          - ContainerPort = 7474
                          - Protocol      = "tcp"
                          - hostPort      = 7474
                        },
                      - {
                          - ContainerPort = 7473
                          - Protocol      = "tcp"
                          - hostPort      = 7473
                        },
                      - {
                          - ContainerPort = 7687
                          - Protocol      = "tcp"
                          - hostPort      = 7687
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NEO4J_AUTH"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 400000
                          - name      = "nofile"
                          - softLimit = 400000
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.template_file.sentinel_neo4j_forwarder_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "sentinel_neo4j_forwarder_container_definition"  {
      ~ id       = "3ec8dbe5433dfcee80fce188f4c65efd8ef43619e13c297760b26d4e4467183e" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "NEO4J_URI"
                          - value = "bolt://neo4j.internal.local:7687"
                        },
                      - {
                          - name  = "NEO4J_USER"
                          - value = "neo4j"
                        },
                      - {
                          - name  = "LOG_TYPE"
                          - value = "CartographyTest"
                        },
                    ]
                  - essential        = true
                  - image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/sentinel_neo4j_forwarder:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sentinel_neo4j_forwarder"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "sentinel_neo4j_forwarder-task"
                        }
                    }
                  - name             = "sentinel_neo4j_forwarder"
                  - secrets          = [
                      - {
                          - name      = "NEO4J_SECRETS_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password"
                        },
                      - {
                          - name      = "CUSTOMER_ID"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/customer_id"
                        },
                      - {
                          - name      = "SHARED_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/shared_key"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "LOG_TYPE"                       = "CartographyTest" -> "Cartography"
            # (9 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_service.neo4j will be updated in-place
  ~ resource "aws_ecs_service" "neo4j" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/cloud_asset_discovery/neo4j"
        name                               = "neo4j"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:9" -> (known after apply)
        # (14 unchanged attributes hidden)





        # (6 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.cartography must be replaced
-/+ resource "aws_ecs_task_definition" "cartography" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:6" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "AWS_CONFIG_FILE"
                          - value = "/config/role_config"
                        },
                      - {
                          - name  = "NEO4J_URI"
                          - value = "bolt://neo4j.internal.local:7687"
                        },
                      - {
                          - name  = "NEO4J_USER"
                          - value = "neo4j"
                        },
                    ]
                  - essential        = true
                  - image            = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/security-tools/cloud_asset_inventory/cartography:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/cartography"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "cartography-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "cartography"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
    ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
